app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
	def new
    @post = Post.new
    @category = Category.all

INSERT INTO "posts" ("body", "category_id", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "dsfasdf"], ["category_id", 3], ["created_at", "2015-10-13 12:12:08.288472"], ["title", "dfasdf"], ["updated_at", "2015-10-13 12:12:08.288472"]]
---
	def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = 12  [["body", "newddd\r\n"], ["updated_at", "2015-10-13 17:40:58.606141"]]
---
	def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)